artilleryTest.yml
config:
  # make sure the target below is not https, otherwise all requests will result in errors
  target: 'http://localhost:4000' 
  phases:
    - duration: 30
      arrivalRate: 1000
  # defaults:
  #   headers:
  #     x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: '/restaurants/42'